<a href="https://colab.research.google.com/github/PalakKumari/ML-Learn-small-proj/blob/master/csvfile.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
data= pd.read_csv("/content/nba.csv")
data

              Name            Team  ...            College     Salary
0    Avery Bradley  Boston Celtics  ...              Texas  7730337.0
1      Jae Crowder  Boston Celtics  ...          Marquette  6796117.0
2     John Holland  Boston Celtics  ...  Boston University        NaN
3      R.J. Hunter  Boston Celtics  ...      Georgia State  1148640.0
4    Jonas Jerebko  Boston Celtics  ...                NaN  5000000.0
..             ...             ...  ...                ...        ...
453   Shelvin Mack       Utah Jazz  ...             Butler  2433333.0
454      Raul Neto       Utah Jazz  ...                NaN   900000.0
455   Tibor Pleiss       Utah Jazz  ...                NaN  2900000.0
456    Jeff Withey       Utah Jazz  ...             Kansas   947276.0
457            NaN             NaN  ...                NaN        NaN

[458 rows x 9 columns]

In [ ]:
type(data)

pandas.core.frame.DataFrame

In [ ]:
data.head()

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        NaN
3    R.J. Hunter  Boston Celtics    28.0  ...  185.0      Georgia State  1148640.0
4  Jonas Jerebko  Boston Celtics     8.0  ...  231.0                NaN  5000000.0

[5 rows x 9 columns]

In [ ]:
data.head(3)

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        NaN

[3 rows x 9 columns]

In [ ]:
data.tail()

             Name       Team  Number Position  ...  Height Weight  College     Salary
453  Shelvin Mack  Utah Jazz     8.0       PG  ...     6-3  203.0   Butler  2433333.0
454     Raul Neto  Utah Jazz    25.0       PG  ...     6-1  179.0      NaN   900000.0
455  Tibor Pleiss  Utah Jazz    21.0        C  ...     7-3  256.0      NaN  2900000.0
456   Jeff Withey  Utah Jazz    24.0        C  ...     7-0  231.0   Kansas   947276.0
457           NaN        NaN     NaN      NaN  ...     NaN    NaN      NaN        NaN

[5 rows x 9 columns]

In [ ]:
import random
for i in range (5):
  random.seed(0)
  print(random.randint(1,100))

50
50
50
50
50

In [ ]:
data.sample(random_state=3)

            Name               Team  Number  ... Weight       College     Salary
305  Patty Mills  San Antonio Spurs     8.0  ...  185.0  Saint Mary's  3578947.0

[1 rows x 9 columns]

In [ ]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    object
 2   Number    457 non-null    float64
 3   Position  457 non-null    object
 4   Age       457 non-null    float64
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   373 non-null    object
 8   Salary    446 non-null    float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB

In [ ]:
#case1: remove if all data are null
data.isnull().sum()

Name         1
Team         1
Number       1
Position     1
Age          1
Height       1
Weight       1
College     85
Salary      12
dtype: int64

In [ ]:
len(data)

458

In [ ]:
data1 = data.dropna(axis=0)

In [ ]:
data1 = data.dropna(axis=0, how="all")

In [ ]:
len(data1)

457

In [ ]:
data1.isnull().sum()

Name         0
Team         0
Number       0
Position     0
Age          0
Height       0
Weight       0
College     84
Salary      11
dtype: int64

In [ ]:
data1= data.dropna(axis=0, how="any")

In [ ]:
len(data1)

364

In [ ]:
data1.isnull().sum()

Name        0
Team        0
Number      0
Position    0
Age         0
Height      0
Weight      0
College     0
Salary      0
dtype: int64

In [ ]:
# case2: remove rows if any column data is null
data1 = data.dropna(axis=0, how="any")
len(data1)

364

In [ ]:
# remove rows if any column data is null
data1= data.dropna(axis=0, how="any", subset=["College"])

In [ ]:
len(data1)

373

In [ ]:
data1.isnull().sum()

Name        0
Team        0
Number      0
Position    0
Age         0
Height      0
Weight      0
College     0
Salary      9
dtype: int64

In [ ]:
# short the data
data_new= data.sort_values("Salary", ascending=False)

In [ ]:
data_new

                Name                    Team  ...                College      Salary
109      Kobe Bryant      Los Angeles Lakers  ...                    NaN  25000000.0
169     LeBron James     Cleveland Cavaliers  ...                    NaN  22970500.0
33   Carmelo Anthony         New York Knicks  ...               Syracuse  22875000.0
251    Dwight Howard         Houston Rockets  ...                    NaN  22359364.0
339       Chris Bosh              Miami Heat  ...           Georgia Tech  22192730.0
..               ...                     ...  ...                    ...         ...
350    Briante Weber              Miami Heat  ...  Virginia Commonwealth         NaN
353    Dorell Wright              Miami Heat  ...                    NaN         NaN
397     Axel Toupane          Denver Nuggets  ...                    NaN         NaN
409       Greg Smith  Minnesota Timberwolves  ...           Fresno State         NaN
457              NaN                     NaN  ...                    NaN         NaN

[458 rows x 9 columns]

In [ ]:
# loc and iloc function
data_new.iloc[3]

Name          Dwight Howard
Team        Houston Rockets
Number                   12
Position                  C
Age                      30
Height                 6-11
Weight                  265
College                 NaN
Salary          2.23594e+07
Name: 251, dtype: object

In [ ]:
data_new.loc[251]

Name          Dwight Howard
Team        Houston Rockets
Number                   12
Position                  C
Age                      30
Height                 6-11
Weight                  265
College                 NaN
Salary          2.23594e+07
Name: 251, dtype: object

In [ ]:
data_new.iloc[:]

                Name                    Team  ...                College      Salary
109      Kobe Bryant      Los Angeles Lakers  ...                    NaN  25000000.0
169     LeBron James     Cleveland Cavaliers  ...                    NaN  22970500.0
33   Carmelo Anthony         New York Knicks  ...               Syracuse  22875000.0
251    Dwight Howard         Houston Rockets  ...                    NaN  22359364.0
339       Chris Bosh              Miami Heat  ...           Georgia Tech  22192730.0
..               ...                     ...  ...                    ...         ...
350    Briante Weber              Miami Heat  ...  Virginia Commonwealth         NaN
353    Dorell Wright              Miami Heat  ...                    NaN         NaN
397     Axel Toupane          Denver Nuggets  ...                    NaN         NaN
409       Greg Smith  Minnesota Timberwolves  ...           Fresno State         NaN
457              NaN                     NaN  ...                    NaN         NaN

[458 rows x 9 columns]

In [ ]:
data.iloc[3:10, :]

            Name            Team  Number  ... Weight         College      Salary
3    R.J. Hunter  Boston Celtics    28.0  ...  185.0   Georgia State   1148640.0
4  Jonas Jerebko  Boston Celtics     8.0  ...  231.0             NaN   5000000.0
5   Amir Johnson  Boston Celtics    90.0  ...  240.0             NaN  12000000.0
6  Jordan Mickey  Boston Celtics    55.0  ...  235.0             LSU   1170960.0
7   Kelly Olynyk  Boston Celtics    41.0  ...  238.0         Gonzaga   2165160.0
8   Terry Rozier  Boston Celtics    12.0  ...  190.0      Louisville   1824360.0
9   Marcus Smart  Boston Celtics    36.0  ...  220.0  Oklahoma State   3431040.0

[7 rows x 9 columns]

In [ ]:
data.iloc[3:10, 2:5]

   Number Position   Age
3    28.0       SG  22.0
4     8.0       PF  29.0
5    90.0       PF  29.0
6    55.0       PF  21.0
7    41.0        C  25.0
8    12.0       PG  22.0
9    36.0       PG  22.0

In [ ]:
data.iloc[3:10][["Number", "Position", "Age"]]

   Number Position   Age
3    28.0       SG  22.0
4     8.0       PF  29.0
5    90.0       PF  29.0
6    55.0       PF  21.0
7    41.0        C  25.0
8    12.0       PG  22.0
9    36.0       PG  22.0

In [ ]:
data_new

                Name                    Team  ...                College      Salary
109      Kobe Bryant      Los Angeles Lakers  ...                    NaN  25000000.0
169     LeBron James     Cleveland Cavaliers  ...                    NaN  22970500.0
33   Carmelo Anthony         New York Knicks  ...               Syracuse  22875000.0
251    Dwight Howard         Houston Rockets  ...                    NaN  22359364.0
339       Chris Bosh              Miami Heat  ...           Georgia Tech  22192730.0
..               ...                     ...  ...                    ...         ...
350    Briante Weber              Miami Heat  ...  Virginia Commonwealth         NaN
353    Dorell Wright              Miami Heat  ...                    NaN         NaN
397     Axel Toupane          Denver Nuggets  ...                    NaN         NaN
409       Greg Smith  Minnesota Timberwolves  ...           Fresno State         NaN
457              NaN                     NaN  ...                    NaN         NaN

[458 rows x 9 columns]

In [ ]:
#reset the index value (back to original)
data_new= data_new.reset_index()
data_new

     index             Name  ...                College      Salary
0      109      Kobe Bryant  ...                    NaN  25000000.0
1      169     LeBron James  ...                    NaN  22970500.0
2       33  Carmelo Anthony  ...               Syracuse  22875000.0
3      251    Dwight Howard  ...                    NaN  22359364.0
4      339       Chris Bosh  ...           Georgia Tech  22192730.0
..     ...              ...  ...                    ...         ...
453    350    Briante Weber  ...  Virginia Commonwealth         NaN
454    353    Dorell Wright  ...                    NaN         NaN
455    397     Axel Toupane  ...                    NaN         NaN
456    409       Greg Smith  ...           Fresno State         NaN
457    457              NaN  ...                    NaN         NaN

[458 rows x 10 columns]

In [ ]:
data_new= data_new.drop(["index"], axis=1)
data_new.head()

              Name                 Team  ...       College      Salary
0      Kobe Bryant   Los Angeles Lakers  ...           NaN  25000000.0
1     LeBron James  Cleveland Cavaliers  ...           NaN  22970500.0
2  Carmelo Anthony      New York Knicks  ...      Syracuse  22875000.0
3    Dwight Howard      Houston Rockets  ...           NaN  22359364.0
4       Chris Bosh           Miami Heat  ...  Georgia Tech  22192730.0

[5 rows x 9 columns]

In [ ]:
data_new.loc[251]

Name            Ramon Sessions
Team        Washington Wizards
Number                       7
Position                    PG
Age                         30
Height                     6-3
Weight                     190
College                 Nevada
Salary             2.17046e+06
Name: 251, dtype: object

In [ ]:
data.to_csv("mynewdata.csv")

In [ ]:
import pandas as pd
data = pd.read_csv("/content/diabetes.csv")

In [ ]:
data.head(10)

   Pregnancies  Glucose  BloodPressure  ...  DiabetesPedigreeFunction  Age  Outcome
0            6      148             72  ...                     0.627   50        1
1            1       85             66  ...                     0.351   31        0
2            8      183             64  ...                     0.672   32        1
3            1       89             66  ...                     0.167   21        0
4            0      137             40  ...                     2.288   33        1
5            5      116             74  ...                     0.201   30        0
6            3       78             50  ...                     0.248   26        1
7           10      115              0  ...                     0.134   29        0
8            2      197             70  ...                     0.158   53        1
9            8      125             96  ...                     0.232   54        1

[10 rows x 9 columns]

In [ ]:
data1 = data.values
data1

array([[  6.   , 148.   ,  72.   , ...,   0.627,  50.   ,   1.   ],
       [  1.   ,  85.   ,  66.   , ...,   0.351,  31.   ,   0.   ],
       [  8.   , 183.   ,  64.   , ...,   0.672,  32.   ,   1.   ],
       ...,
       [  5.   , 121.   ,  72.   , ...,   0.245,  30.   ,   0.   ],
       [  1.   , 126.   ,  60.   , ...,   0.349,  47.   ,   1.   ],
       [  1.   ,  93.   ,  70.   , ...,   0.315,  23.   ,   0.   ]])

In [ ]:
x = data1[:, 0:8]
print(x)

[[  6.    148.     72.    ...  33.6     0.627  50.   ]
 [  1.     85.     66.    ...  26.6     0.351  31.   ]
 [  8.    183.     64.    ...  23.3     0.672  32.   ]
 ...
 [  5.    121.     72.    ...  26.2     0.245  30.   ]
 [  1.    126.     60.    ...  30.1     0.349  47.   ]
 [  1.     93.     70.    ...  30.4     0.315  23.   ]]

In [ ]:
y = data1[:,8]
print(y)

[1. 0. 1. 0. 1. 0. 1. 0. 1. 1. 0. 1. 0. 1. 1. 1. 1. 1. 0. 1. 0. 0. 1. 1.
 1. 1. 1. 0. 0. 0. 0. 1. 0. 0. 0. 0. 0. 1. 1. 1. 0. 0. 0. 1. 0. 1. 0. 0.
 1. 0. 0. 0. 0. 1. 0. 0. 1. 0. 0. 0. 0. 1. 0. 0. 1. 0. 1. 0. 0. 0. 1. 0.
 1. 0. 0. 0. 0. 0. 1. 0. 0. 0. 0. 0. 1. 0. 0. 0. 1. 0. 0. 0. 0. 1. 0. 0.
 0. 0. 0. 1. 1. 0. 0. 0. 0. 0. 0. 0. 0. 1. 1. 1. 0. 0. 1. 1. 1. 0. 0. 0.
 1. 0. 0. 0. 1. 1. 0. 0. 1. 1. 1. 1. 1. 0. 0. 0. 0. 0. 0. 0. 0. 0. 0. 1.
 0. 0. 0. 0. 0. 0. 0. 0. 1. 0. 1. 1. 0. 0. 0. 1. 0. 0. 0. 0. 1. 1. 0. 0.
 0. 0. 1. 1. 0. 0. 0. 1. 0. 1. 0. 1. 0. 0. 0. 0. 0. 1. 1. 1. 1. 1. 0. 0.
 1. 1. 0. 1. 0. 1. 1. 1. 0. 0. 0. 0. 0. 0. 1. 1. 0. 1. 0. 0. 0. 1. 1. 1.
 1. 0. 1. 1. 1. 1. 0. 0. 0. 0. 0. 1. 0. 0. 1. 1. 0. 0. 0. 1. 1. 1. 1. 0.
 0. 0. 1. 1. 0. 1. 0. 0. 0. 0. 0. 0. 0. 0. 1. 1. 0. 0. 0. 1. 0. 1. 0. 0.
 1. 0. 1. 0. 0. 1. 1. 0. 0. 0. 0. 0. 1. 0. 0. 0. 1. 0. 0. 1. 1. 0. 0. 1.
 0. 0. 0. 1. 1. 1. 0. 0. 1. 0. 1. 0. 1. 1. 0. 1. 0. 0. 1. 0. 1. 1. 0. 0.
 1. 0. 1. 0. 0. 1. 0. 1. 0. 1. 1. 1. 0. 0. 1. 0. 1. 0. 0. 0. 1. 0. 0. 0.
 0. 1. 1. 1. 0. 0. 0. 0. 0. 0. 0. 0. 0. 1. 0. 0. 0. 0. 0. 1. 1. 1. 0. 1.
 1. 0. 0. 1. 0. 0. 1. 0. 0. 1. 1. 0. 0. 0. 0. 1. 0. 0. 1. 0. 0. 0. 0. 0.
 0. 0. 1. 1. 1. 0. 0. 1. 0. 0. 1. 0. 0. 1. 0. 1. 1. 0. 1. 0. 1. 0. 1. 0.
 1. 1. 0. 0. 0. 0. 1. 1. 0. 1. 0. 1. 0. 0. 0. 0. 1. 1. 0. 1. 0. 1. 0. 0.
 0. 0. 0. 1. 0. 0. 0. 0. 1. 0. 0. 1. 1. 1. 0. 0. 1. 0. 0. 1. 0. 0. 0. 1.
 0. 0. 1. 0. 0. 0. 0. 0. 0. 0. 0. 0. 1. 0. 0. 0. 0. 0. 0. 0. 1. 0. 0. 0.
 1. 0. 0. 0. 1. 1. 0. 0. 0. 0. 0. 0. 0. 1. 0. 0. 0. 0. 1. 0. 0. 0. 1. 0.
 0. 0. 1. 0. 0. 0. 1. 0. 0. 0. 0. 1. 1. 0. 0. 0. 0. 0. 0. 1. 0. 0. 0. 0.
 0. 0. 0. 0. 0. 0. 0. 1. 0. 0. 0. 1. 1. 1. 1. 0. 0. 1. 1. 0. 0. 0. 0. 0.
 0. 0. 0. 0. 0. 0. 0. 0. 1. 1. 0. 0. 0. 0. 0. 0. 0. 1. 0. 0. 0. 0. 0. 0.
 0. 1. 0. 1. 1. 0. 0. 0. 1. 0. 1. 0. 1. 0. 1. 0. 1. 0. 0. 1. 0. 0. 1. 0.
 0. 0. 0. 1. 1. 0. 1. 0. 0. 0. 0. 1. 1. 0. 1. 0. 0. 0. 1. 1. 0. 0. 0. 0.
 0. 0. 0. 0. 0. 0. 1. 0. 0. 0. 0. 1. 0. 0. 1. 0. 0. 0. 1. 0. 0. 0. 1. 1.
 1. 0. 0. 0. 0. 0. 0. 1. 0. 0. 0. 1. 0. 1. 1. 1. 1. 0. 1. 1. 0. 0. 0. 0.
 0. 0. 0. 1. 1. 0. 1. 0. 0. 1. 0. 1. 0. 0. 0. 0. 0. 1. 0. 1. 0. 1. 0. 1.
 1. 0. 0. 0. 0. 1. 1. 0. 0. 0. 1. 0. 1. 1. 0. 0. 1. 0. 0. 1. 1. 0. 0. 1.
 0. 0. 1. 0. 0. 0. 0. 0. 0. 0. 1. 1. 1. 0. 0. 0. 0. 0. 0. 1. 1. 0. 0. 1.
 0. 0. 1. 0. 1. 1. 1. 0. 0. 1. 1. 1. 0. 1. 0. 1. 0. 1. 0. 0. 0. 0. 1. 0.]

In [ ]:
import cv2
from google.colab.patches import cv2_imshow
video = cv2.VideoCapture("video.avi")
while True:
  ret, img = video.read()
  if ret==True:
    cv2_imshow(img)
    if cv2.waitKey(1)==2:
      break
  else:
    break
cv2.destoryAllWindows()